In [1]:
import numpy as np
import pandas as pd

In [2]:
#pandas operations
#conditional selection
#access rows and cols
#add and delete columns
#concatenation merging and joining dataframe
#handling missing values
#access()

In [3]:
d = {'USN':[100,101,102],
     'Name':['jerry','tom','ramesh'],
     'Mobile':[99,98,77],
     'marks':[30,35,32]
    }

In [4]:
std = pd.DataFrame(d)

In [5]:
std

   USN    Name  Mobile  marks
0  100   jerry      99     30
1  101     tom      98     35
2  102  ramesh      77     32

In [6]:
#dataframe operations
std.head(2)
#head - displaying rows
#display all by default
#parameter passed, display rows as per parameters

   USN   Name  Mobile  marks
0  100  jerry      99     30
1  101    tom      98     35

In [7]:
#list of columns in df
std.columns

Index(['USN', 'Name', 'Mobile', 'marks'], dtype='object')

In [8]:
std.info()
#gives all info about the df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [9]:
std.isnull()
#any missing values

     USN   Name  Mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [10]:
#access columns
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [11]:
#accessing mulitple columns
std[['USN','marks']]

   USN  marks
0  100     30
1  101     35
2  102     32

In [12]:
#access rows
std.loc[1]
#returns row

USN       101
Name      tom
Mobile     98
marks      35
Name: 1, dtype: object

In [13]:
#create a dataframe cars having the attributes car id, car name.
#should have 5 values

In [14]:
car = {
    'car_id':[5,6,7,8,9],
    'car_name':['Alto','Wagonr','Fortuner','Ertiga',np.nan]
}

In [15]:
df = pd.DataFrame(car)

In [16]:
df.head()

   car_id  car_name
0       5      Alto
1       6    Wagonr
2       7  Fortuner
3       8    Ertiga
4       9       NaN

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   car_id    5 non-null      int64
 1   car_name  4 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [18]:
df.loc(1)

In [19]:
df.iloc(1)

In [20]:
df['car_id']

0    5
1    6
2    7
3    8
4    9
Name: car_id, dtype: int64

In [21]:
df.loc[1]

car_id           6
car_name    Wagonr
Name: 1, dtype: object

In [22]:
df.iloc[0]

car_id         5
car_name    Alto
Name: 0, dtype: object

In [23]:
df[['car_id','car_name']]

   car_id  car_name
0       5      Alto
1       6    Wagonr
2       7  Fortuner
3       8    Ertiga
4       9       NaN

In [24]:
df.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False      True

In [25]:
df.iloc[4]

car_id        9
car_name    NaN
Name: 4, dtype: object

In [26]:
#conditional selection
std[std['marks']<35]

   USN    Name  Mobile  marks
0  100   jerry      99     30
2  102  ramesh      77     32

In [27]:
df1 = std['marks']<35

In [28]:
std[df1]['Name']

0     jerry
2    ramesh
Name: Name, dtype: object

In [29]:
std[(std['USN']>100) & (std['marks']<40)]

   USN    Name  Mobile  marks
1  101     tom      98     35
2  102  ramesh      77     32

In [30]:
#adding new columns 
s = "bangalore,delhi,kashmir".split(',')
print(s,type(s))

['bangalore', 'delhi', 'kashmir'] <class 'list'>

In [31]:
std['Address'] = s

In [32]:
std

   USN    Name  Mobile  marks    Address
0  100   jerry      99     30  bangalore
1  101     tom      98     35      delhi
2  102  ramesh      77     32    kashmir

In [33]:
df1.isnull()

0    False
1    False
2    False
Name: marks, dtype: bool

In [34]:
std.isnull()

     USN   Name  Mobile  marks  Address
0  False  False   False  False    False
1  False  False   False  False    False
2  False  False   False  False    False

In [35]:
a = {
    'USN':[None,None,102],
    'Name':[None,None,'ramesh'],
    'Mobile':[99,98,97],
    'marks':[38,32,37]
}

In [36]:
a1 = pd.DataFrame(a)

In [37]:
a1

     USN    Name  Mobile  marks
0    NaN    None      99     38
1    NaN    None      98     32
2  102.0  ramesh      97     37

In [38]:
a1.isnull()

     USN   Name  Mobile  marks
0   True   True   False  False
1   True   True   False  False
2  False  False   False  False

In [39]:
a1.dropna(thresh = 2)

     USN    Name  Mobile  marks
0    NaN    None      99     38
1    NaN    None      98     32
2  102.0  ramesh      97     37

In [40]:
a1.dropna(axis = 1)

   Mobile  marks
0      99     38
1      98     32
2      97     37

In [41]:
df.iloc[[0,1]]

   car_id car_name
0       5     Alto
1       6   Wagonr